# 2023-03-22
# 수정
# 
#
#
''''
이것은 여러줄짜리 주석입니다 보석 비석 자석 구석 

'''

print("오늘은 파이썬 수업입니다 ㅋ ㅋ ")
print('hello !! ')
print(type("오늘은 파이썬 수업입니다 ㅋ ㅋ "))

print(2)
print(type(2))
print(5.5)

print("Hello " + "Pyton")
print("213호 " * 3)
print("Hello " ,"hi ",213 , " ", 1111)
# 에러에라이 print("Hello" + 33)
print("Hello" ,33)

#한번에 여러 자료 출력
print(1,2,-5,3.14,2.741828)
print('Hi','Pyton')

print('23000원은','5000원 ?개','1000원 ?개')
print('5000원' ,23000 // 5000,'개')
print('1000원',(23000%5000)//1000,'개')

print("3 + 8 ")
print(3+8)
print("3 + 8 =",3+8)

var='3+8'
print(eval(var))
print(var)

print(1+62-3*52)
print(256*553-152)

print(162353290930//539253 + 162353290930%539253)

print('78000은','50000원 ?개' , '10000원 ?개' , '5000원 ?개' )
a=78000//50000
b=78000%50000
c=b//10000
d=b%10000
e=d//5000
f=d%5000

print('50000원' , a , "장")
print('10000원' , c ,"장")
print('5000원' , e , "장")